# Manipulação EDA da base de dados Titanic

## Importando pacotes e bibliotecas

In [1]:
from matplotlib import pyplot as plt
import seaborn as sas
import pandas as pd
import numpy as np
#---
from utils.tratar_dados import *
from utils.funcoes_graficas import *

## Importando base de dados

### Importando de um .csv

In [2]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

### Importando de um .pkl

In [3]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

## Tratamento dos dados

### Passando os títulos para minúsculo

In [4]:
titulos = titanic_dataframe.columns
titulos = fix_header_to_standarts(titulos)
titanic_dataframe.columns = titulos

### Remoção de espaços

In [5]:
# Nao foi necessario

### Remoção de caracteres proibidos

In [6]:
# Nao foi necessario

### Normalização dos dados

In [7]:
titanic_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  418 non-null    int64
 1   survived     418 non-null    int64
 2   pclass       418 non-null    int64
 3   name         418 non-null    object
 4   sex          418 non-null    object
 5   age          332 non-null    float64
 6   sibsp        418 non-null    int64
 7   parch        418 non-null    int64
 8   ticket       418 non-null    object
 9   fare         417 non-null    float64
 10  cabin        91 non-null     object
 11  embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [8]:
titanic_dataframe.sample(10)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
343,1235,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.00,0,1,PC 17755,512.3292,B51 B53 B55,C
354,1246,1,3,"Dean, Miss. Elizabeth Gladys Millvina""""",female,0.17,1,2,C.A. 2315,20.5750,NaN,S
259,1151,0,3,"Midtsjo, Mr. Karl Albert",male,21.00,0,0,345501,7.7750,NaN,S
123,1015,0,3,"Carver, Mr. Alfred John",male,28.00,0,0,392095,7.2500,NaN,S
32,924,1,3,"Dean, Mrs. Bertram (Eva Georgetta Light)",female,33.00,1,2,C.A. 2315,20.5750,NaN,S
286,1178,0,3,"Franklin, Mr. Charles (Charles Fardon)",male,NaN,0,0,SOTON/O.Q. 3101314,7.2500,NaN,S
76,968,0,3,"Miles, Mr. Frank",male,NaN,0,0,359306,8.0500,NaN,S
346,1238,0,2,"Botsford, Mr. William Hull",male,26.00,0,0,237670,13.0000,NaN,S
350,1242,1,1,"Greenfield, Mrs. Leo David (Blanche Strouse)",female,45.00,0,1,PC 17759,63.3583,D10 D12,C
31,923,0,2,"Jefferys, Mr. Clifford Thomas",male,24.00,2,0,C.A. 31029,31.5000,NaN,S

#### Tratamento de NaNs

##### Coluna "cabin"

In [9]:
coluna_cabine = "cabin"
for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna("Unknown")


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
163,1055,0,3,"Pearce, Mr. Ernest",male,NaN,0,0,343271,7.0000,Unknown,S
208,1100,1,1,"Rosenbaum, Miss. Edith Louise",female,33.0,0,0,PC 17613,27.7208,A11,C
216,1108,1,3,"Mahon, Miss. Bridget Delia",female,NaN,0,0,330924,7.8792,Unknown,Q
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,Unknown,S
319,1211,0,2,"Jefferys, Mr. Ernest Wilfred",male,22.0,2,0,C.A. 31029,31.5000,Unknown,S

##### Coluna "age"

In [10]:
coluna_cabine = "age"
media = int(round(titanic_dataframe.age.mean(), 0))

for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna(media)


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
245,1137,0,1,"Kenyon, Mr. Frederick R",male,41.0,1,0,17464,51.8625,D21,S
365,1257,1,3,"Sage, Mrs. John (Annie Bullen)",female,30.0,1,9,CA. 2343,69.5500,Unknown,S
248,1140,1,2,"Hold, Mrs. Stephen (Annie Margaret Hill)",female,29.0,1,0,26707,26.0000,Unknown,S
98,990,1,3,"Braf, Miss. Elin Ester Maria",female,20.0,0,0,347471,7.8542,Unknown,S
25,917,0,3,"Robins, Mr. Alexander A",male,50.0,1,0,A/5. 3337,14.5000,Unknown,S

##### Coluna "embarked"

In [11]:
titanic_dataframe.embarked.unique()

array(['Q', 'S', 'C'], dtype=object)

In [12]:
# NAO EXECUTE ESSA CELUNA MAIS DE UMA UNICA VEZ
titanic_dataframe.embarked = titanic_dataframe.embarked.map({
    "C": 0,
    "Q": 1,
    "S": 2
    }
)

In [13]:
titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
299,1191,0,3,"Johansson, Mr. Nils",male,29.0,0,0,347467,7.8542,Unknown,2
131,1023,0,1,"Gracie, Col. Archibald IV",male,53.0,0,0,113780,28.5000,C51,0
332,1224,0,3,"Thomas, Mr. Tannous",male,30.0,0,0,2684,7.2250,Unknown,0
249,1141,1,3,"Khalil, Mrs. Betros (Zahie Maria"" Elias)""",female,30.0,1,0,2660,14.4542,Unknown,0
315,1207,1,3,"Hagardon, Miss. Kate",female,17.0,0,0,AQ/3. 30631,7.7333,Unknown,1

#### Tratamento de tipos

In [18]:
id_max = titanic_dataframe.passengerid.max()
fare_max = round(titanic_dataframe.fare.max(), 2)
print(f"O maior id é:\t\t{id_max}\nA maior tarifa é:\t{fare_max}\n")

O maior id é:		1309
A maior tarifa é:	512.33